---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveSubordFromGroupWarn
source: html/5a860cc6-63a2-942b-f44f-1330a5bc777d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveSubordFromGroupWarn Property

Element can't be removed or excluded from the Group because it is required by another Group element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveSubordFromGroupWarn { get; }
```